nxp-mcuxpresso/mcuxsdk-examples/_boards/frdmmcxn947t/driver_examples/smartcard/pin_mux.c
    const port_pin_config_t port3_22_pinM16_config = {/* Internal pull-up/down resistor is disabled */
                                                      .pullSelect = kPORT_PullDisable,
                                                      /* Low internal pull resistor value is selected. */
                                                      .pullValueSelect = kPORT_LowPullResistor,
                                                      /* Fast slew rate is configured */
                                                      .slewRate = kPORT_FastSlewRate,
                                                      /* Passive input filter is disabled */
                                                      .passiveFilterEnable = kPORT_PassiveFilterDisable,
                                                      /* Open drain output is disabled */
                                                      .openDrainEnable = kPORT_OpenDrainDisable,
                                                      /* Low drive strength is configured */
                                                      .driveStrength = kPORT_LowDriveStrength,
                                                      /* Pin is configured as SIM0_VCCEN */
                                                      .mux = kPORT_MuxAlt9,
                                                      /* Digital input enabled */
                                                      .inputBuffer = kPORT_InputBufferEnable,
                                                      /* Digital input is not inverted */
                                                      .invertInput = kPORT_InputNormal,
                                                      /* Pin Control Register fields [15:0] are not locked */
                                                      .lockRegister = kPORT_UnlockRegister};
    /* PORT3_22 (pin M16) is configured as SIM0_VCCEN */
    PORT_SetPinConfig(PORT3, 22U, &port3_22_pinM16_config);
}
/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
